tap "dracos/custom", "git@github.com:dracos/homebrew-custom"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
brew "libpng"
brew "gettext"
brew "pkg-config"
brew "closure-compiler"
brew "fish"
brew "gcc"
brew "hdf5"
brew "netcdf"
brew "openblas"
brew "numpy"
brew "python@3.10"
brew "gdal"
brew "imagemagick"
brew "jhead"
brew "jq"
brew "mp3wrap"
brew "node"
brew "perl"
brew "php"
brew "poetry"
brew "postgresql", restart_service: true
brew "python@3.9"
brew "postgis"
cask "catlight"
cask "dracos-manager"
cask "firefox"
cask "google-chrome"
cask "hot"
cask "iterm2"
cask "keepassxc"
cask "licecap"
cask "maccy"
cask "openvpn-connect"
cask "spotify"
