tap "dracos/custom", "git@github.com:dracos/homebrew-custom"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# Library for manipulating PNG images
brew "libpng"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Next generation open source RPC library and framework
brew "grpc"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Collection of portable C++ source libraries
brew "boost"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Manage compile and link flags for libraries
brew "pkg-config"
# Vector graphics library with cross-device output support
brew "cairo"
# Computational Geometry Algorithms Library
brew "cgal"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# JavaScript optimizing compiler
brew "closure-compiler"
# Python 2 and 3 compatibility utilities
brew "six"
# Suite of command-line tools for converting to and working with CSV
brew "csvkit"
# C library implementing the SSH2 protocol
brew "libssh2"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Text processing system for reStructuredText
brew "docutils"
# Easiest way to build and release mobile apps
brew "fastlane"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Image processing and image analysis library
brew "leptonica"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU compiler collection
brew "gcc"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# File format designed to store large amounts of data
brew "hdf5"
# Cartographic Projections Library
brew "proj"
# Library and tools for dealing with GeoTIFF
brew "libgeotiff"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# Package for scientific computing with Python
brew "numpy"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Geospatial Data Abstraction Library
brew "gdal"
# Utility for downloading TV and radio programmes from BBC iPlayer
brew "get_iplayer"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GIF image/animation creator/editor
brew "gifsicle"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fulltext search engine and column store
brew "groonga"
# Next generation open source RPC library and framework
brew "grpc@1.54"
# Platform built on V8 to build network applications
brew "node"
# JavaScript Task Runner
brew "grunt-cli"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Configurable static site generator
brew "hugo"
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Extract Digicam setting info from EXIF JPEG headers
brew "jhead"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Implementation of JSON Schema for Python
brew "jsonschema"
# Framework for scientific data networking
brew "libdap"
# I/O abstraction library for dealing with structured file formats
brew "libgsf"
# Implementation of the file(1) command
brew "libmagic"
# C library for reading and writing MATLAB MAT files
brew "libmatio"
# Library to render SVG files using Cairo
brew "librsvg"
# Web and API based SMTP testing tool
brew "mailhog"
# Drop-in replacement for MySQL
brew "mariadb", restart_service: true
# High performance, distributed memory object caching system
brew "memcached", restart_service: true
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Wrap two or more mp3 files in a single large file
brew "mp3wrap"
# Platform built on V8 to build network applications
brew "node@18"
# PNG file optimizer
brew "optipng"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Mozilla CA bundle for Python
brew "python-certifi"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Python package management tool
brew "poetry"
# Object-relational database system
brew "postgresql@14"
# C++ wrapper library around CGAL
brew "sfcgal"
# Adds support for geographic objects to PostgreSQL
brew "postgis"
# Generic syntax highlighter
brew "pygments"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Persistent key-value database, with built-in net interface
brew "redis"
# Tool to create intelligent and beautiful documentation
brew "sphinx-doc"
# Generic Python virtualenv management and test command-line tool
brew "tox"
# Image processing library
brew "vips"
# C++ search engine library
brew "xapian"
# Download YouTube videos from the command-line
brew "youtube-dl"
# General-purpose lossless data-compression library
brew "zlib"
# Web security testing toolkit
cask "burp-suite"
# Action center for developers
cask "catlight"
# API documentation browser and code snippet manager
cask "dash"
# App to build and share containerized applications and microservices
cask "docker"
# Free accounting software for small business
cask "dracos-manager"
# Web browser focusing on privacy
cask "duckduckgo"
# Web browser
cask "firefox"
# Multilingual font
cask "font-gentium-plus"
# Web browser
cask "google-chrome"
# Menu bar application that displays the CPU speed limit due to thermal issues
cask "hot"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Password manager app
cask "keepassxc"
# Desktop shield and keystroke interceptor
cask "keyboard-cleaner"
# Animated screen capture application
cask "licecap"
# Clipboard manager
cask "maccy"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Video streaming service player
cask "now-tv-player"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Geographic Information System
cask "qgis"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Multimedia player
cask "vlc"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Native desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
